Repository: astarub/campus_app
Catalog: assets/l10n/l10n_*.arb
Languages: ar, de

source: Hello World!
ar: مرحباً بالعالم!
de: Hallo Welt!

# serverFailureMessage
source: Could not load server data.
ar: تعذر تحميل بيانات الخادم.
de: Serverdaten konnten nicht geladen werden.

# generalFailureMessage
source: An error has occurred.
ar: حدث خطأ.
de: Ein Fehler ist aufgetreten.

# errorMessage
source: Error.
ar: خطأ.
de: Fehler.

# unexpectedError
source: An unexpected error occured...
ar: حدث خطأ غير متوقع...
de: Ein unerwarteter Fehler ist aufgetreten...

# invalid2FATokenFailureMessage
source: Your TOTP is incorrect. Please try again!
ar: رمز المصادقة (TOTP) غير صحيح. حاول مرة أخرى!
de: Dein Einmalcode (TOTP) is ungültig. Bitte versuche es erneut!

# invalidLoginIDAndPasswordFailureMessage
source: The credentials are invalid!
ar: بيانات الاعتماد غير صحيحة!
de: Die Anmeldedaten sind ungültig!

source: Welcome!
ar: أهلاً وسهلاً!
de: Willkommen!

# login_prompt
source: Please login with your RUB-ID and password.
ar: يرجى تسجيل الدخول باستخدام معرف RUB وكلمة المرور الخاصة بك.
de: Bitte melde dich mit deiner RUB-ID und deinem Passwort an.

# rubid
source: Login-ID of your RUB-Account
ar: معرف تسجيل الدخول لحساب RUB الخاص بك
de: Login-ID von deinem RUB-Account

source: Password
ar: كلمة المرور
de: Passwort

source: Login
ar: تسجيل الدخول
de: Anmelden

# empty_input_field
source: Please enter your credentials!
ar: يرجى إدخال بيانات الاعتماد الخاصة بك!
de: Bitte gib deine Anmeldedaten ein!

# login_error
source: Invalid input!
ar: إدخال غير صالح!
de: Ungültige Eingabe!

# login_success
source: Successfully logged in!
ar: تم تسجيل الدخول بنجاح!
de: Erfolgreich angemeldet!

# login_already
source: Allready logged in.
ar: تم تسجيل الدخول مسبقاً.
de: Du bist bereits angemeldet.

# enter_totp
source: Please enter your TOTP.
ar: يرجى إدخال رمز المصادقة لمرة واحدة (TOTP).
de: Bitte gib deinen Einmalcode (TOTP) ein.

source: Close
de: Schließen

source: Done
de: Abschließen

# feedRight
source: Explore
de: Entdecken

# calendarEventLocationToBeAnnounced
source: Event location to be announced.
de: Veranstaltungsort wird noch bekannt gegeben.

# calendarEventNoDescriptionGiven
source: No description given.
de: Keine Beschreibung vorhanden.

# calendarEventHost
source: Host
de: Veranstalter:in

# calendarEventVenue
source: Venue
de: Veranstaltungsort

# calendarEventNotificationOff
source: Remove from Saved Events
de: Nicht mehr merken

# calendarEventNotificationOn
source: Save Event
de: Merken

# calendarPageUpcoming
source: Upcoming
de: Anstehend

# calendarPageSaved
source: Saved
de: Gemerkt

# calendarPageNoEventsUpcomingTitle
source: No events coming up
de: Keine Events in Sicht

# calendarPageNoEventsUpcomingText
source: There are no events currently planned. Check back later!
de: Es sind gerade keine Events geplant. Schau am besten später nochmal vorbei.

# calendarPageNoEventsSavedTitle
source: No events saved
de: Keine gemerkten Events

# calendarPageNoEventsSavedText
source: Save events to see them here.
de: Merke dir Events, um sie hier zu sehen.

# navBarMore
source: More
de: Mehr

# navBarCalendar
source: Calendar
de: Kalender

# firebaseDecisionPopup
source: To show you notifactions about spontaneous Events and Dates around campus, we currently use the Google service Firebase. If that is a concern to you, we will respect that. We plan to provide an alternative starting in January.
de: Um dir Benachrichtigungen über spontane Events und Termine rund um die Uni schicken zu können, verwenden wir derzeit Firebase, einen Service von Google. Solltest du dies nicht wollen, respektieren wir das. Im Januar werden wir dafür eine Google-freie Alternative einführen.

# firebaseDecisionPopupSlim
source: To show you notifactions about spontaneous Events and Dates around campus, we currently use the Google service Firebase. If that is a concern to you, we will respect that. We plan to provide an alternative starting in January.
de: Um dir Benachrichtigungen über spontane Events und Termine rund um die Uni schicken zu können, verwenden wir derzeit Firebase, einen Service von Google. Solltest du dies nicht wollen, respektieren wir das. Im Januar werden wir dafür eine Google-freie Alternative einführen.

# firebaseDecisionAccept
source: Yes, I don't mind.
de: Ja, kein Problem

# firebaseDecisionDecline
source: No, I don't want that.
de: Nein, möchte ich nicht.

# chooseStudyProgram
source: Choose your study program.
de: Wähle deinen Studiengang

# onboardingPresentedBy
source: Presented by your AStA
de: Präsentiert von deinem AStA

# onboardingLanguage
source: Language
de: Sprache

# onboardingLanguageDetailed
source: Choose your preferred language.
de: Wähle deine bevorzugte Sprache aus.

# onboardingStudyProgram
source: Study Program
de: Studiengang

# onboardingStudyProgramDetailed
source: Choose your study program to see curated events and news.
de: Wähle deinen aktuellen Studiengang, um für dich passende Events und News anzuzeigen.

# onboardingPrivacy
source: Privacy
de: Datenschutz

# onboardingNotifications
source: Activate push notifications
de: Push-Benachrichtigungen aktivieren

# onboardingConfirm
source: Yes, I agree
de: Ja, kein Problem

# onboardingDeny
source: No, I do not agree
de: Nein, möchte ich nicht.

# onboardingThemeDescription
source: Contrast-rich or subdued. Day or Night. Choose your design.
de: Kontrastreich oder unauffällig. Tag oder Nacht. Wähle dein Design.

# onboardingThemeLight
source: Light
de: Hell

# onboardingThemeDark
source: Dark
de: Dunkel

source: Allergens
de: Allergene

# allergensAvoid
source: Avoid
de: Vermeiden von

# allergensWheat
source: Wheat
de: Weizen

# allergensRye
source: Rye
de: Roggen

# allergensBarley
source: Barley
de: Gerste

# allergensOats
source: Oats
de: Hafer

# allergensSpelt
source: Spelt
de: Dinkel

# allergensCrustaceans
source: Crustaceans
de: Krebstiere

# allergensEggs
source: Eggs
de: Eier

# allergensFish
source: Fish
de: Fisch

# allergensPeanuts
source: Peanuts
de: Erdnüsse

# allergensSoybeans
source: Soybeans
de: Sojabohnen

# allergensMilk
source: Milk
de: Milch

# allergensNuts
source: Nuts
de: Schalenfrüchte

# allergensAlmond
source: Almond
de: Mandeln

# allergensHazelnut
source: Hazelnut
de: Haselnuss

# allergensWalnut
source: Walnut
de: Walnuss

# allergensCashewnut
source: Cashewnut
de: Cashewnuss

# allergensPecan
source: Pecan
de: Pecanuss

# allergensBrazilNut
source: BrazilNut
de: Paranuss

# allergensPistachio
source: Pistachio
de: Pistazie

# allergensMacadamia
source: Macadamia
de: Macadamia-/Queenslandnuss

# allergensCelery
source: Celery
de: Sellerie

# allergensMustard
source: Mustard
de: Senf

# allergensSesame
source: Sesame
de: Sesamsamen

# allergensSulfur
source: Sulfur
de: Schwefeloxid

# allergensLupins
source: Lupins
de: Lupinen

# allergensMolluscs
source: Molluscs
de: Weichtiere

# mondayShort
source: Mon
de: Mo

# tuesdayShort
source: Tue
de: Di

# wednesdayShort
source: Wed
de: Mi

# thursdayShort
source: Thu
de: Do

# fridayShort
source: Fri
de: Fr

# saturdayShort
source: Sat
de: Sa

# sundayShort
source: Sun
de: So

# mealPreferences
source: Preferences
de: Präferenzen

# preferencesExclusive
source: Exclusively
de: Ausschließlich

# preferencesVegetarian
source: Vegetarian
de: Vegetarisch

# preferencesAvoid
source: Avoid
de: Vermeiden von

# preferencesAlcohol
source: Alcohol
de: Alkohol

# preferencesFish
source: Fish
de: Fisch

# preferencesPoultry
source: Poultry
de: Geflügel

# preferencesLamb
source: Lamb
de: Lamm

# preferencesBeef
source: Beef
de: Rind

# preferencesPork
source: Pork
de: Schwein

# preferencesGame
source: Game
de: Wild

# mensaPageTitle
source: Dining Hall
de: Mensa

# mensaPagePreferences
source: Preferences
de: Präferenzen

# mensaPageAllergens
source: Allergens
de: Allergene

# imprintPageLegalNotice
source: Legal Notice
de: Impressum

# morePageTitle
source: Settings & More
de: Einstellungen & Mehr

# morePageBikeWorkshop
source: Bike Workshop
de: Fahrradwerkstatt

# morePageSocialCounseling
source: Social Counseling
de: Sozialberatung

# morePageDancingGroup
source: Dancing Group
de: Tanzkreis

# morePageUsefulLinks
source: Useful Links
de: Nützliche Links

# morePageUniSports
source: University Sports
de: Hochschulsport

# morePageOther
source: Other
de: Sonstiges

# morePageSettings
source: Settings
de: Einstellungen

# morePagePrivacy
source: Privacy
de: Datenschutz

# morePageLegalNotice
source: Legal Notice
de: Impressum

# morePageUsedResources
source: Used Resources
de: Verwendete Ressourcen

# settingsSettings
source: Settings
de: Einstellungen

# settingsHeadlineCoreData
source: Core Data
de: Stammdaten

# settingsStudyProgram
source: Study Program
de: Studiengang

# settingsLanguage
source: Language
de: Sprache

# settingsStudyProgramChange
source: Change
de: Ändern

# settingsHeadlineBehaviour
source: Behaviour
de: Verhalten

# settingsUseExternalBrowser
source: Use External Browser for Links
de: Verwende externen Browser für Links

# settingsTextSize
source: Use System Text Size
de: Verwende Textgröße des Systems

# settingsTicketFullscreen
source: Use Full-Screen for Semesterticket QR-Code
de: Vollbildschirmmodus QR-Code Semesterticket

# settingsHeadlinePrivacy
source: Privacy
de: Datenschutz

# settingsGoogleServices
source: Google Services for Notifications
de: Google Services für Benachrichtigungen

# settingsHeadlinePushNotifications
source: Push-Notifications
de: Push-Benachrichtigungen

# settingsPushNotificationsEvents
source: Push-Notifications for saved Events
de: Benachrichtigungen für gespeicherte Events

# controlRoomButton
source: RUB Control Room
ar: غرفة التحكم في جامعة بوخوم
de: Leitwarte der RUB

# controlRoomButtonDescription
source: Always in service, for any emergency
ar: متواجدون دائمًا، لأي حالة طارئة
de: 24/7 besetzt, für jegliche Notfälle

# walletAddStudentTicket
source: Add your semester ticket
ar: أضف تذكرة الفصل الدراسي الخاصة بك
de: Füge dein Semesterticket hinzu

# balanceMultipleTags
source: Multiple NFC-Tags found! Try again.
ar: تم العثور على عدة بطاقات NFC! حاول مرة أخرى.
de: Mehrere NFC-Tags gefunden! Versuche es noch einmal.

# balanceIOSScanCard
source: Scan your card.
ar: امسح بطاقتك.
de: Scanne deine Karte.

# balanceMensaBalance
source: Mensa Balance
ar: رصيد الكافتيريا
de: Mensa Guthaben

# balanceBalance
source: Balance:
ar: الرصيد:
de: Guthaben:

# balanceLastTransaction
source: Last Transaction:
ar: آخر عملية:
de: Letzte Abbuchung:

# balanceScanCard
source: Scan Card
ar: امسح البطاقة
de: Karte scannen

# balanceScanCardDetailed
source: Hold your student ID to your phone to scan it.
ar: ضع بطاقة الطالب الخاصة بك قرب هاتفك لمسحها.
de: Halte deinen Studierendenausweis an dein Smartphone, um ihn zu scannen.

# balanceNFCOff
source: NFC deactivated
ar: تم تعطيل NFC
de: NFC deaktiviert

# balanceNFCOffDetailed
source: Your NFC needs to be activated to read your AKAFÖ balance.
ar: يجب تفعيل NFC لقراءة رصيد بطاقة AKAFÖ الخاصة بك.
de: Um dein AKAFÖ Guthaben auslesen zu können, muss NFC aktiviert sein.

# balanceLastBalance
source: Last Balance:
ar: آخر رصيد:
de: Letztes Guthaben:

# balanceLastScanned
source: Last scanned Transaction:
ar: آخر عملية ممسوحة:
de: Letzte gescannte Abbuchung:

# ticketLoginPasswort
source: RUB Password
ar: كلمة مرور RUB
de: RUB Passwort

# ticketLoginBothFieldsError
source: Please fill in both fields!
ar: يرجى ملء كلا الحقلين!
de: Bitte fülle beide Felder aus!

# ticketLoginInternetError
source: Check your internet connection!
ar: تحقق من اتصالك بالإنترنت!
de: Überprüfe deine Internetverbindung!

# ticketLoginWrongDataError
source: Wrong LoginID or Password!
ar: معرف الدخول أو كلمة المرور غير صحيحة!
de: Falsche LoginID und/oder Passwort!

# ticketLoginLoadingError
source: Error while loading the ticket!
ar: حدث خطأ أثناء تحميل التذكرة!
de: Fehler beim Laden des Tickets!

# ticketLoginEncryptedInfo
source: Your data is encrypted and saved locally. It is only sent to the RUB servers when logging in.
ar: يتم تشفير بياناتك وتخزينها محليًا. يتم إرسالها فقط إلى خوادم RUB عند تسجيل الدخول.
de: Deine Daten werden verschlüsselt auf deinem Gerät gespeichert und nur bei der Anmeldung an die RUB gesendet.

# walletPageBalance
source: Dining Hall Balance
ar: رصيد الكافتيريا
de: Mensa Guthaben

# walletPageComingInFuture
source: This area will be expanded in future versions to integrate useful guides.
ar: سيتم توسيع هذا القسم في الإصدارات المستقبلية لدمج أدلة مفيدة.
de: Dieser Bereich wird in zukünftigen Versionen stetig ergänzt und um nützliche Hilfen in die App zu integrieren.

# faqEmergencyNumberText
source: Die Ruhr-Universität verfügt über eine Leitwarte, die 24 Stunden besetzt und über die Nummer durchgehend erreichbar ist. Bei Notfällen alarmiert sie Feuerwehr, Notarzt oder Polizei und zuständige Stellen innerhalb der Universität. Speichert euch die Notruf-Nummer am besten in euer Handy ein: <a href="tel:+492343223333">0234 3223333</a>
ar: تمتلك جامعة الرور في بوخوم غرفة مراقبة تعمل على مدار الساعة ويمكن الوصول إليها دائمًا عبر الهاتف. في حالات الطوارئ، يتم إخطار خدمات الإطفاء أو الإسعاف أو الشرطة وكذلك الجهات المعنية في الجامعة. من الأفضل حفظ رقم الطوارئ على هاتفك: 0234 3223333

# ticketLoginLoginID
source: RUB LoginID
ar: معرف تسجيل الدخول إلى RUB

# ticketLoginLogin
source: Login
ar: تسجيل الدخول

# walletPageWallet
source: Wallet
ar: المحفظة

# walletPageCampusABC
source: Campus ABC
ar: قاموس الحرم الجامعي ABC
